Importing Pandas package

In [1]:
import pandas as pd

Reading CSV and making dataframe from it as Housedf

In [2]:
Housedf = pd.read_csv('LondonHousingData.csv')

Checking top 5 records in dataframe using head() function

In [3]:
Housedf.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

Checking shape of the data frame. Means Rows and Columns

In [4]:
Housedf.shape

(13549, 6)

Getting information on each column using info() function

In [5]:
Housedf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 6 columns):
date             13549 non-null object
area             13549 non-null object
average_price    13549 non-null int64
code             13549 non-null object
houses_sold      13455 non-null float64
no_of_crimes     7439 non-null float64
dtypes: float64(2), int64(1), object(3)
memory usage: 635.2+ KB

Getting more detailed information on dataset using Describe function

In [6]:
Housedf.describe(include = 'all')

,date,area,average_price,code,houses_sold,no_of_crimes
count,13549,13549,1.354900e+04,13549,13455.000000,7439.000000
unique,301,45,NaN,45,NaN,NaN
top,2/1/1996,enfield,NaN,E09000010,NaN,NaN
freq,47,302,NaN,302,NaN,NaN
mean,NaN,NaN,2.635197e+05,NaN,3893.994129,2158.352063
std,NaN,NaN,1.876175e+05,NaN,12114.402476,902.087742
min,NaN,NaN,4.072200e+04,NaN,2.000000,0.000000
25%,NaN,NaN,1.323800e+05,NaN,247.000000,1623.000000
50%,NaN,NaN,2.229190e+05,NaN,371.000000,2132.000000
75%,NaN,NaN,3.368430e+05,NaN,3146.000000,2582.000000
max,NaN,NaN,1.463378e+06,NaN,132163.000000,7461.000000

Checking the columns in dataframe using columns attribute

In [7]:
Housedf.columns

Index(['date', 'area', 'average_price', 'code', 'houses_sold', 'no_of_crimes'], dtype='object')

Counting the number rows null in each column

In [8]:
Housedf.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

As we can see Houses Sold coulmn has 94 Null values, hence we can fill those null values with mean of the column

In [9]:
Housedf['houses_sold'] = Housedf['houses_sold'].fillna(Housedf['houses_sold'].mean())

In [10]:
Housedf.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold         0
no_of_crimes     6110
dtype: int64

Now in No_of_crimes column more than half of values are null then we can drop the column as well there is no link between price of houses and no of crimes

In [11]:
Housedf.drop(columns = {'no_of_crimes'}, inplace = True)

In [12]:
Housedf.head()

       date            area  average_price       code  houses_sold
0  1/1/1995  city of london          91449  E09000001         17.0
1  2/1/1995  city of london          82203  E09000001          7.0
2  3/1/1995  city of london          79121  E09000001         14.0
3  4/1/1995  city of london          77101  E09000001          7.0
4  5/1/1995  city of london          84409  E09000001         10.0

As type of Date column is Object so we will convert the column data type to date

In [13]:
Housedf['date'] = pd.to_datetime(Housedf['date'])

In [14]:
Housedf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 5 columns):
date             13549 non-null datetime64[ns]
area             13549 non-null object
average_price    13549 non-null int64
code             13549 non-null object
houses_sold      13549 non-null float64
dtypes: datetime64[ns](1), float64(1), int64(1), object(2)
memory usage: 529.3+ KB

As price is in int data type e can convert it into float as it is currency

In [15]:
Housedf['average_price'] = Housedf['average_price'].astype('float64')

In [16]:
Housedf.dtypes

date             datetime64[ns]
area                     object
average_price           float64
code                     object
houses_sold             float64
dtype: object

Different areas present in our data frame

In [17]:
Housedf.area.unique()

array(['city of london', 'barking and dagenham', 'barnet', 'bexley',
       'brent', 'bromley', 'camden', 'croydon', 'ealing', 'enfield',
       'tower hamlets', 'greenwich', 'hackney', 'south east',
       'hammersmith and fulham', 'haringey', 'harrow', 'havering',
       'hillingdon', 'hounslow', 'islington', 'kensington and chelsea',
       'kingston upon thames', 'lambeth', 'lewisham', 'merton', 'newham',
       'redbridge', 'richmond upon thames', 'southwark', 'sutton',
       'waltham forest', 'wandsworth', 'westminster', 'inner london',
       'outer london', 'north east', 'north west', 'yorks and the humber',
       'east midlands', 'west midlands', 'east of england', 'london',
       'south west', 'england'], dtype=object)

We can find the Sum of average price as per different areas present

In [18]:
# group by object
area_grp = Housedf.groupby('area')

In [19]:
area_grp.average_price.sum()

area
barking and dagenham       48115732.0
barnet                     91802318.0
bexley                     57060792.0
brent                      81357667.0
bromley                    76502347.0
camden                    140717774.0
city of london            127606718.0
croydon                    63014251.0
ealing                     82635734.0
east midlands              36616617.0
east of england            51525851.0
enfield                    67385450.0
england                    46073722.0
greenwich                  64129998.0
hackney                    86065570.0
hammersmith and fulham    133581350.0
haringey                   88183860.0
harrow                     81039164.0
havering                   61713026.0
hillingdon                 70254884.0
hounslow                   71025592.0
inner london               94813321.0
islington                 109921503.0
kensington and chelsea    223360171.0
kingston upon thames       84788216.0
lambeth                    84098927.0
lewisham                   65197170.0
london                     79920745.0
merton                     84670929.0
newham                     58889466.0
north east                 29209364.0
north west                 32745662.0
outer london               72049172.0
redbridge                  70763028.0
richmond upon thames      115167404.0
south east                 59212257.0
south west                 49169329.0
southwark                  82776379.0
sutton                     65399307.0
tower hamlets              77690411.0
waltham forest             66338943.0
wandsworth                103033564.0
west midlands              38257955.0
westminster               163703647.0
yorks and the humber       32842916.0
Name: average_price, dtype: float64

We can get the sum of Houses sold as per different areas

In [20]:
area_grp.houses_sold.sum()

area
barking and dagenham      6.728599e+04
barnet                    1.414360e+05
bexley                    1.051390e+05
brent                     8.940099e+04
bromley                   1.563040e+05
camden                    8.214999e+04
city of london            1.537399e+04
croydon                   1.536940e+05
ealing                    1.178300e+05
east midlands             2.041512e+06
east of england           2.817588e+06
enfield                   1.269310e+05
england                   2.308542e+07
greenwich                 1.019140e+05
hackney                   7.703798e+04
hammersmith and fulham    8.330599e+04
haringey                  8.894999e+04
harrow                    8.670899e+04
havering                  1.029230e+05
hillingdon                1.125090e+05
hounslow                  9.325999e+04
inner london              1.241619e+06
islington                 7.605899e+04
kensington and chelsea    8.491599e+04
kingston upon thames      8.341499e+04
lambeth                   1.257410e+05
lewisham                  1.159110e+05
london                    3.142166e+06
merton                    9.504999e+04
newham                    9.402399e+04
north east                1.041463e+06
north west                2.903068e+06
outer london              1.904797e+06
redbridge                 1.102990e+05
richmond upon thames      1.048620e+05
south east                4.206798e+06
south west                2.647449e+06
southwark                 1.075020e+05
sutton                    9.918699e+04
tower hamlets             1.135390e+05
waltham forest            1.007260e+05
wandsworth                1.716590e+05
west midlands             2.136766e+06
westminster               1.144820e+05
yorks and the humber      2.191550e+06
Name: houses_sold, dtype: float64

We can get the average number of Houses sold in an area

In [21]:
area_grp.houses_sold.mean()

area
barking and dagenham        223.541489
barnet                      469.887004
bexley                      349.298964
brent                       297.013250
bromley                     519.282353
camden                      272.923549
city of london               51.076373
croydon                     510.611257
ealing                      391.461755
east midlands              6782.431855
east of england            9360.757436
enfield                     420.301266
england                   76695.764081
greenwich                   338.584679
hackney                     255.092657
hammersmith and fulham      276.764081
haringey                    295.514911
harrow                      288.069728
havering                    341.936838
hillingdon                  373.784014
hounslow                    309.833848
inner london               4124.980027
islington                   252.687669
kensington and chelsea      282.112918
kingston upon thames        277.126207
lambeth                     417.744147
lewisham                    385.086340
london                    10439.089662
merton                      315.780692
newham                      312.372054
north east                 3460.009928
north west                 9644.744147
outer london               6328.229197
redbridge                   366.441821
richmond upon thames        348.378699
south east                13929.794644
south west                 8795.511589
southwark                   357.149463
sutton                      329.524878
tower hamlets               375.956895
waltham forest              334.637835
wandsworth                  570.295642
west midlands              7098.890326
westminster                 380.338831
yorks and the humber       7280.896971
Name: houses_sold, dtype: float64